# Pandas

In [1]:
import numpy as np
import pandas as pd
pd.__version__

'0.19.2'

In [3]:
pd.Series(["a", "b", "c"])

0    a
1    b
2    c
dtype: object

In [7]:
name = pd.Series(["a", "b", "c"])
num = pd.Series([123, 345, 567])

data = pd.DataFrame({"name":name, "num":num})

In [8]:
data

  name  num
0    a  123
1    b  345
2    c  567

In [9]:
print(data["name"])

0    a
1    b
2    c
Name: name, dtype: object

In [15]:
print(type(name[name]))

<class 'pandas.core.series.Series'>

### manuplating

In [16]:
data['A']=pd.Series([1, 2, 3])   ### 추가

In [17]:
data

  name  num  A
0    a  123  1
1    b  345  2
2    c  567  3

In [ ]:
data[]

### loading CSV file

In [18]:
dat = pd.read_csv("train.csv")   ### 불러오기

In [19]:
dat[:10]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [23]:
iris = pd.read_csv("iris.csv")   ### 불러오기

In [24]:
iris[:10]

   sepal_length  sepal_width  petal_length  petal_width  target_name
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa
5           5.4          3.9           1.7          0.4  Iris-setosa
6           4.6          3.4           1.4          0.3  Iris-setosa
7           5.0          3.4           1.5          0.2  Iris-setosa
8           4.4          2.9           1.4          0.2  Iris-setosa
9           4.9          3.1           1.5          0.1  Iris-setosa

In [25]:
iris['fix'] = pd.Series(0)

In [26]:
iris[:10]

   sepal_length  sepal_width  petal_length  petal_width  target_name  fix
0           5.1          3.5           1.4          0.2  Iris-setosa  0.0
1           4.9          3.0           1.4          0.2  Iris-setosa  NaN
2           4.7          3.2           1.3          0.2  Iris-setosa  NaN
3           4.6          3.1           1.5          0.2  Iris-setosa  NaN
4           5.0          3.6           1.4          0.2  Iris-setosa  NaN
5           5.4          3.9           1.7          0.4  Iris-setosa  NaN
6           4.6          3.4           1.4          0.3  Iris-setosa  NaN
7           5.0          3.4           1.5          0.2  Iris-setosa  NaN
8           4.4          2.9           1.4          0.2  Iris-setosa  NaN
9           4.9          3.1           1.5          0.1  Iris-setosa  NaN

In [ ]:
### Iris-setosa Iris-versicolor Iris-virginica